{"id":42,"date":"2021-03-21T19:20:43","date_gmt":"2021-03-21T19:20:43","guid":{"rendered":"http:\/\/classicrangebernedoodles.com\/?page_id=42"},"modified":"2021-10-18T06:51:49","modified_gmt":"2021-10-18T06:51:49","slug":"shipping","status":"publish","type":"page","link":"https:\/\/Teacup poodleyard.com\/shipping\/","title":{"rendered":"SHIPPING"},"content":{"rendered":"\n<div class=\"row\"  id=\"row-1327870309\">\n\n\n\t<div class=\"col small-12 large-12\"  >\n\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\n\t<div id=\"gap-675362963\" class=\"gap-element clearfix\" style=\"display:block; height:auto;\">\n\t\t\n<style scope=\"scope\">\n\n#gap-675362963 {\n  padding-top: 60px;\n}\n<\/style>\n\t<\/div>\n\t\n\n<p style=\"text-align: center;\">Shipping Process:<\/p>\n<p style=\"text-align: center;\">“GET 30 DAYS 100% MONEY BACK GUARANTEE WITH EVERY PUPPY”<\/p>\n<p>How to ship your Puppy<\/p>\n<p>While we welcome everyone to pick up their Puppy atPeter's Smart Home&#8217;s Home, this is so you can see exactly where your Puppy comes from, we do realize that it is not ideal for all of our customers, so we provide air shipping to most states.<\/p>\n<p>We primarily use American Airlines, WestJet and Delta Airlines. All our Puppies are shipped in a travel crate of medium size that is ideal for approximately the first 6 months of crate training. All Puppies that are shipped will be micro-chipped. Our Puppies are very well taken care of during the shipping process, and We have never incurred any shipping problems through these companies. I try to ship with American and Delta airlines but will utilize United and Alaskan airlines when needed. If it is necessary to ship with United Airlines or Alaskan Airlines the price will be higher. All prices can vary with locations and time of year.<\/p>\n<p>All Puppies are 10 weeks of age before they are ready to ship. Your Puppy will arrive the same day it is shipped, and you will be given a time of arrival within which you will have to pick up at your closest airport or home delivery can be arranged to your desired address too. You will also need a picture ID in order to receive your Puppy, so please notify us before shipping if someone other than you will be picking your Puppy up so that we can get the correct names for the paperwork.<\/p>\n<p>Is it really Safe to ship a Puppy?<\/p>\n<p>Many people ask if it is safe to ship a Puppy. Flying in an airplane is just as safe as traveling in a car and possibly less stressful then a long car ride. A lot of people think animals are drugged, put in a box, tossed around with the rest of the baggage or left in hot planes for hours etc.. If this was true then we would never ship our Puppies !! After almost 7 years of shipping Puppies all over the USA and Canada we have never had one problem besides normal flight delays and that is fairly rare as well. United Pet Safe and Alaska Airlines are the best pet shippers by far. Your Puppy will not be stacked on top of suitcases. Airlines have special places for pets so that they will be protected from cargo and luggage. It is temperature controlled and pressurized just like the cabin. Puppies are never drugged. They’re shipped in a new airline approved plastic crate in which they can easily see out the sides and front, with food, water, and a blanket. During layovers (if there is one) the Puppies are taken off the plane and placed in a temperature controlled holding room until they can be put on their connecting flight. My Wife preparing the dog crate for shipping Extra food is taped to the side of the crate in the event of an unexpected layover\/delay. Shipping pups takes a lot of time and planning. Pups must be taken to the vet just before shipping to get a shipping health certificate. We’ve safely shipped our Pomeranian Puppies all over the United States and Canada without any problem .<\/p>\n<p>For more information or to arrange for a direct home delivery of your new Puppy, please text or Email us. How It Works For a flat service fee your Puppy will be hand-delivered to your home address after arrival from your major airport ! Once the purchase of your Puppy is complete,<\/p>\n<p>We will work with you to make all the necessary travel arrangements. After selecting an agreed upon time, date, and flight, we will email you the travel information. Your Puppy will fly safely to meet you at your nearest major airport or at your home address. During the flight, A shipping agent always supervises your Puppy and tends to your Puppy’s every need. You are Welcome to Pick Up Your Puppy And Meet The Parents And Grand parents too!<\/p>\n<p>You will see the loving temperaments of all our Pomeranian Puppies and the environment where they have been raised. Note, We currently have a FREE SHIPPING promotion offered by the delivery agency to ship 2 Puppies for free so the first 2 Puppies bought from us will be shipped free (Puppy nanny services included).<\/p>\n<p>WE ARE TOTALLY COMMITTED TO BEING A REPUTABLE, LOVING AND RESPONSIBLE POMERANIAN BREEDERS.<\/p>\n\n\t\t<\/div>\n\t<\/div>\n\n\t\n\n<\/div>\n\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-blank.php","meta":[],"_links":{"self":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages\/42"}],"collection":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/comments?post=42"}],"version-history":[{"count":6,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages\/42\/revisions"}],"predecessor-version":[{"id":316,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages\/42\/revisions\/316"}],"wp:attachment":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/media?parent=42"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}