{"id":48,"date":"2021-03-21T19:29:06","date_gmt":"2021-03-21T19:29:06","guid":{"rendered":"http:\/\/classicrangebernedoodles.com\/?page_id=48"},"modified":"2021-10-18T06:55:26","modified_gmt":"2021-10-18T06:55:26","slug":"our-guarantee","status":"publish","type":"page","link":"https:\/\/Teacup poodleyard.com\/our-guarantee\/","title":{"rendered":"OUR GUARANTEE"},"content":{"rendered":"\n<div class=\"row\"  id=\"row-186466368\">\n\n\n\t<div class=\"col small-12 large-12\"  >\n\t\t<div class=\"col-inner\"  >\n\t\t\t\n\t\t\t\n\n\t<div id=\"gap-1780266764\" class=\"gap-element clearfix\" style=\"display:block; height:auto;\">\n\t\t\n<style scope=\"scope\">\n\n#gap-1780266764 {\n  padding-top: 60px;\n}\n<\/style>\n\t<\/div>\n\t\n\n<p style=\"text-align: center;\"><span style=\"color: #000000;\"><strong><span style=\"font-size: 120%;\">OUR GUARANTEE<\/span><\/strong><\/span><\/p>\n<p class=\"has-text-color\"><span style=\"font-size: 115%; color: #282828;\">All puppies have a wellness check by the seller’s veterinarian at 8 weeks of age. If the puppy is being shipped to the buyer, either by air or ground, the total cost of the puppy and shipping expenses must be paid by the buyer to the seller in full before the puppy is shipped out.<\/span><\/p>\n<p class=\"has-text-color\"><span style=\"font-size: 115%; color: #282828;\"> For the protection of the new owner of the puppy and the seller, buyer requires the puppy be examined by a licensed veterinarian, at the expense of the new owner, within 72 hours of receiving the puppy. A copy of this exam must be emailed or mailed to the seller within one week of the puppy’s arrival or the guarantee will be null and void. If this puppy is found to have a serious health issue at the 72 hours exam and is unable to be medically treated, a replacement puppy, refund or full refund will be given to the buyer. This will be determined by the seller. To qualify for a replacement, full refund of payment, the buyer must return the puppy alive at their expense, to the seller within 72 hours of the exam. Buyer must provide a signed document from the veterinarian stating the problem. Registration papers given at the time of sale must accompany return. The seller reserves the right to require a second veterinary exam on the returned puppy before any replacement or refund is given. All veterinarian expenses are at the expense of the new owner and not refundable.<\/span><\/p>\n<p class=\"has-text-color\"><span style=\"font-size: 115%; color: #282828;\"> Seller does not guarantee against conditions brought on by stress or environmental changes that cannot be controlled once the puppy leavesPeter's Smart Home. The seller will not be responsible for parvo, distemper virus after 1 month, as these are such highly contagious diseases they can be contracted immediately after leaving the facilities. Also, sellers do not guarantee against hypoglycemia, coccidiosis, viral or bacterial infections (including puppy flu), or parasites.<\/span><\/p>\n<p class=\"has-text-color\"><span style=\"font-size: 115%; color: #282828;\"> Along with your puppy’s CKC registration papers, each puppy goes home with records of his first set of shots, deworming, and overall health exam by a licensed veterinarian.<\/span><\/p>\n<p><span style=\"font-size: 115%; color: #282828;\">When your puppy goes home, your puppy is deemed healthy, to the best of our knowledge and abilities. However once the puppy leaves our care, we cannot guarantee future health.<\/span><\/p>\n<p><span style=\"font-size: 115%; color: #282828;\">We do guarantee the genetic health of our puppies for the first 2 years. The genetic health is defined as a genetic abnormality\/disorder that will eventually cause early death with a life expectancy of less than 5 years, where the disease would progress making euthanasia necessary, or require extensive medical care that would ultimately be beyond the cost of the puppy. If your puppy is determined to have a congenital defect within the first two years of life, we will either replace your puppy with a puppy from a similar litter or refund the purchase price.<\/span><\/p>\n<p class=\"has-text-color\"><span style=\"font-size: 115%; color: #282828;\">If your puppy is to be a pet, please spay or neuter as per your vet’s instruction. Puppies purchased for breeding purposes are not guaranteed to breed.<\/span><\/p>\n\n\t\t<\/div>\n\t<\/div>\n\n\t\n\n<\/div>\n\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-blank.php","meta":[],"_links":{"self":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages\/48"}],"collection":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/comments?post=48"}],"version-history":[{"count":6,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages\/48\/revisions"}],"predecessor-version":[{"id":317,"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/pages\/48\/revisions\/317"}],"wp:attachment":[{"href":"https:\/\/Teacup poodleyard.com\/wp-json\/wp\/v2\/media?parent=48"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}